Revit 2027 API
RebarFreeFormAccessor.SetCurves Method
Overload List
Name | Description
SetCurves(IList<CurveLoop>) |  Set the curves into a free form Rebar. Will throw exception if the rebar has valid constraints.
SetCurves(IList<IList<Curve>>) |  Set the curves into a free form Rebar. Will throw exception if the rebar has valid constraints.
Top
See Also
Reference
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace